#問6 駒場東大前駅を駒場駅と東大前駅に分ける
import copy

inokashira2 = ["渋谷駅","神泉駅","駒場東大前駅","池の上駅","下北沢駅","新代田駅","東松原駅","明大前駅","永福町駅", "西永福町駅","浜田山駅","高井戸駅","富士見ヶ丘駅","久我山駅","三鷹台駅","井の頭公園駅","吉祥寺駅"]
t = copy.copy(inokashira2)
i = t.index("駒場東大前駅")
#駒場東大前駅を削除
del t[i]
#駒場駅と東大前駅を追加
t.insert(i,"駒場駅")
t.insert(i,"東大前駅")

def test():
    correct_answer = ['渋谷駅', '神泉駅', '東大前駅', '駒場駅', '池の上駅', '下北沢駅', '新代田駅', '東松原駅', '明大前駅', '永福町駅', '西永福町駅', '浜田山駅', '高井戸駅', '富士見ヶ丘駅', '久我山駅', '三鷹台駅', '井の頭公園駅', '吉祥寺駅']
    print(t == correct_answer)

test()

#駅数をNとした時の計算量は： O(N)
