#問７ 井の頭線と小田急線の共通の駅を求める
def common(a,b):
    common_stations = []
    for i in a:
        for j in b:
            if i == j:
                common_stations.append(i)
    return common_stations

def test():
    inokashira = ["渋谷駅","神泉駅","駒場東大前駅","池の上駅","下北沢駅","新代田駅","東松原駅","明大前駅","永福町駅", "西永福町駅","浜田山駅","高井戸駅","富士見ヶ丘駅","久我山駅","三鷹台駅","井の頭公園駅","吉祥寺駅"]
    odakyuusen = ["新宿駅","南新宿駅","参宮橋駅","代々木八幡駅","代々木上原駅","東北沢駅","下北沢駅","世田谷代田駅","梅ケ原駅", "豪徳寺駅","経堂駅","千歳船橋駅","祖師ヶ谷大蔵駅","成城学園前駅","喜多見駅","狛江駅","和泉多摩川駅","登戸駅","向ヶ丘遊園駅","生田駅","読売ランド前駅","百合ヶ丘駅","新百合ヶ丘駅","柿生駅"
    ,"鶴川駅","玉川学園前駅","町田駅","相模大野駅","小田急相模原駅", "相武台駅","座間駅","海老名駅","厚木駅","本厚木駅","愛甲石田駅","伊勢原駅","鶴巻温泉駅","東海大学前駅","秦野駅","渋沢駅","新松田駅","開成駅","栢山駅","富水駅","螢田駅","足柄駅","小田原駅"]

    print(common(inokashira, odakyuusen) == ['下北沢駅'])

test()

#それぞれの駅数とN,Mとした時の計算量は： O(MN)
