#問9 2路線の乗り継ぎ
def station(a,b):
    for i in range(len(a)):
        for j in range(len(b)):
            if a[i] == b[j]:
                return a[:i]+b[j:]
    print("乗り換えできる駅がないです。")

def test():
    denentoshisen = ['中央林間駅', 'つきみ野駅', '南町田駅', 'すずかけ台駅', 'つくし野駅', '長津田駅', '田奈駅', '青葉台駅', '藤が丘駅', '市が尾駅', '江田駅', 'あざみ野駅', 'たまプラーザ駅',
                    '鷺沼駅', '宮前平駅', '宮崎台駅', '梶が谷駅', '溝の口駅', '高津駅', '二子新地駅', '二子玉川駅', '用賀駅', '桜新町駅', '駒沢大学駅', '三軒茶屋駅', '池尻大橋駅', '渋谷駅']
    fukutoshin = ["渋谷駅","明治神宮前駅","北参道駅","新宿三丁目駅","東新宿駅","西早稲田駅","雑司が谷駅","池袋駅","要町駅","千川駅","小竹向原駅","氷水台駅","平和台駅","地下鉄赤塚駅","地下鉄成増駅","和光市駅"]
    correct_answer = ['中央林間駅', 'つきみ野駅', '南町田駅', 'すずかけ台駅', 'つくし野駅', '長津田駅', '田奈駅', '青葉台駅', '藤が丘駅', '市が尾駅', '江田駅', 'あざみ野駅', 'たまプラーザ駅','鷺沼駅', '宮前平駅', '宮崎台駅', '梶が谷駅', '溝の口駅', '高津駅', '二子新地駅', '二子玉川駅',
                    '用賀駅', '桜新町駅', '駒沢大学駅', '三軒茶屋駅', '池尻大橋駅', '渋谷駅',"明治神宮前駅","北参道駅","新宿三丁目駅","東新宿駅","西早稲田駅","雑司が谷駅","池袋駅","要町駅","千川駅","小竹向原駅","氷水台駅","平和台駅","地下鉄赤塚駅","地下鉄成増駅","和光市駅"]
    print( station(denentoshisen, fukutoshin) == correct_answer)

test()

#aの駅数をN, bの駅数をMとした時の計算量は： O(MN(M+N))
